<img src=images/ucsc_banner.png width=500>

# Anaconda, Jupyter Notebooks, Pandas Dataframes

This module covers tools which combine to form an interactive and explorative environment for data science.

<img src="images/anaconda_logo.png" width=250>

Anaconda is a package manager and collection of popular scientific Python tools. Installing Anaconda is an easy way to setup a data analysis environment from scratch without worrying about conflicting dependencies that may arise from installing so many disparate pieces of software. Anaconda supports Windows, Mac OS X, and Linux.

Anaconda can be downloaded at https://www.anaconda.com/distribution/ 

Anaconda comes with many of the packages we will be using today like jupyter notebook and pandas. Packages can be installed using `conda install`. 

Here is a helpful cheatsheet for conda commands: https://docs.conda.io/projects/conda/en/4.6.0/_downloads/52a95608c49671267e40c689e0bc00ca/conda-cheatsheet.pdf

# Jupyter Notebooks

<img src="images/jupyter_logo.png" width=250>

Jupyter notebooks used to be called IPython notebooks, but the popularity of notebooks led to the notebook framework being moved into its own project that now supports more languages than just Python.

## Basics

The Jupyter Notebook is a web application that allows you to create and share documents that contain live code, equations, visualizations and explanatory text. Uses include: data cleaning and transformation, numerical simulation, statistical modeling, machine learning and much more.

Jupyter notebooks are comprised of *cells* that allow a user to write small blocks of code or text and execute them.  You can use the menu at the top to create / delete / arrange cells, or you can click **Help -> Keyboard Shortcuts**. I primarily use only two types of cells: code cells and *Markdown* cells for text formatting.  

Besides codifying a methodology in a format that allows for narration to be placed alongside the code used to achieve the result, notebooks are great way to share your research with others as they can download your notebook and run it for themselves.

We'll be using notebooks to visualize *dataframes* and execute Python code on those dataframes all in a single environment.

# Dataframes

A *dataframe* is an abstract concept for **(deep breath)** size-mutable "labeled arrays" that handle heterogeneous data.  If anyone has used the R programming language, then you're already familiar with what a dataframe is. For those who haven't used R, it simply takes the concept of an *array* of data, and applies hierarchical labeling.

## Pandas

Pandas is a Python implementation of the the dataframes model with a ton of cool features. I'll let the author himself provide a brief overview of Pandas: https://vimeo.com/59324550

John Vivian mostly uses Pandas for exploratory data science work, some examples of which can be checked out here:

**Similarity Comparison Between Two RNA-Seq Pipelines** <br>
https://github.com/jvivian/ipython_notebooks/blob/master/RSEM_comparison/RSEM_comparison.ipynb

**Fitting a Distribution to Kallisto Bootstraps** <br>
https://github.com/jvivian/ipython_notebooks/blob/master/kallisto_boostraps/Kallisto%20Bootstraps.ipynb


## Data 

To play around with Pandas, we'll look at some data from IMDB, the internet movie database.

Download cast.csv to the **data/** directory in your forked repo with the following URL: <br>
https://drive.google.com/file/d/0ByHO8wS-fc8HTFJpZDE0T3RBcG8/view?usp=sharing

In [1]:
import pandas as pd

We'll use some CSS styling to make our tables look pretty. This doesn't translate if you view the notebook from Github.

In [2]:
from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))

Now let's read in our dataframes

In [3]:
titles = pd.read_csv('data/titles.csv', index_col=None)
cast = pd.read_csv('data/cast.csv', index_col=None)

There are two main datatypes in Pandas: DataFrames and Series. It's easiest to think of a single column of a pandas dataframe as a series.

In [4]:
type(titles)

pandas.core.frame.DataFrame

In [5]:
type(titles.title)

pandas.core.series.Series

Two of the most useful pandas methods are `head` and `tail`.

In [6]:
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [7]:
cast.tail()

,title,year,name,type,character,n
3499555,Stuttur Frakki,1993,Sveinbj?rg ??rhallsd?ttir,actress,Flugfreyja,24.0
3499556,Foxtrot,1988,Lilja ??risd?ttir,actress,D?ra,24.0
3499557,Niceland (Population. 1.000.002),2004,Sigr??ur J?na ??risd?ttir,actress,Woman in Bus,26.0
3499558,U.S.S.S.S...,2003,Krist?n Andrea ??r?ard?ttir,actress,Afgr.dama ? bens?nst??,17.0
3499559,Bye Bye Blue Bird,1999,Rosa ? R?gvu,actress,Pensionatv?rtinde,NaN

## Dataframe Operations

We can look at any column in our dataframe by using array notation `['column_name']` or dot-method notation.

In [8]:
titles.columns

Index(['title', 'year'], dtype='object')

In [9]:
titles['title'].head()

0             The Rising Son
1    The Thousand Plane Raid
2           Crucea de piatra
3                    Country
4                 Gaiking II
Name: title, dtype: object

In [10]:
titles.title.head()

0             The Rising Son
1    The Thousand Plane Raid
2           Crucea de piatra
3                    Country
4                 Gaiking II
Name: title, dtype: object

There are a lot of built-in dataframe methods

In [11]:
titles.count()

title    225616
year     225616
dtype: int64

In [12]:
titles.sort_values('title').head()

                        title  year
138980       #1 Serial Killer  2013
158682                     #5  2013
84531              #50Fathers  2015
70275                     #66  2015
63318   #73, Shaanthi Nivaasa  2007

In [13]:
titles.sort_values('year').head()

                                                    title  year
172508                                         Miss Jerry  1894
120909     Reproduction of the Corbett and Jeffries Fight  1899
92240                            Trouble in Hogan's Alley  1900
19987   Pierrot's Problem, or How to Make a Fat Wife O...  1900
178104                              Soldiers of the Cross  1900

#### Conditionals

Filtering dataframes can be a bit unintuitive at first, but make sense once you've done it a few times.

Say we wanted to look at every movie named **Hamlet**, how would we do that?  You might try something like:

In [14]:
titles.title == 'Hamlet'

0         False
1         False
2         False
3         False
4         False
5         False
6         False
7         False
8         False
9         False
10        False
11        False
12        False
13        False
14        False
15        False
16        False
17        False
18        False
19        False
20        False
21        False
22        False
23        False
24        False
25        False
26        False
27        False
28        False
29        False
          ...
225586    False
225587    False
225588    False
225589    False
225590    False
225591    False
225592    False
225593    False
225594    False
225595    False
225596    False
225597    False
225598    False
225599    False
225600    False
225601    False
225602    False
225603    False
225604    False
225605    False
225606    False
225607    False
225608    False
225609    False
225610    False
225611    False
225612    False
225613    False
225614    False
225615    False
Name: title, Length: 225616, dtype: bool

Whoa, what is this? What we've gotten back is a *boolean* list of every title and whether or not it's named **Hamlet**, which we can see a majority of are False.  We can use this to filter our original dataframe by *subsetting it*.

In [16]:
titles[titles.title == 'Hamlet']

         title  year
5807    Hamlet  1948
27270   Hamlet  2016
38985   Hamlet  2015
45362   Hamlet  1910
71187   Hamlet  1954
89479   Hamlet  1976
91616   Hamlet  1987
91815   Hamlet  2000
95729   Hamlet  1921
119166  Hamlet  1969
161443  Hamlet  1913
170859  Hamlet  2009
177569  Hamlet  1964
195396  Hamlet  1996
201507  Hamlet  2011
203801  Hamlet  1911
215074  Hamlet  1973
216727  Hamlet  1990
217129  Hamlet  2014

If you have multiple conditionals, you need to wrap them with parentheses and combine them with the `&` operator.

In [17]:
titles[(titles.year < 1959) & (titles.year > 1955)].head()

                                      title  year
38   La momia azteca contra el robot humano  1958
43                              Mavi boncuk  1958
91                      Perdeu-se um Marido  1957
114                              Hi no tori  1956
131                        Quem Sabe, Sabe!  1956

Working with Dataframes is *functional*. You can string together many functions and operations.

In [18]:
cast.head()

                    title  year     name   type                character     n
0         Suuri illusioni  1985   Homo $  actor                   Guests  22.0
1     Battle of the Sexes  2017  $hutter  actor          Bobby Riggs Fan  10.0
2    Secret in Their Eyes  2015  $hutter  actor          2002 Dodger Fan   NaN
3              Steve Jobs  2015  $hutter  actor  1988 Opera House Patron   NaN
4  Straight Outta Compton  2015  $hutter  actor              Club Patron   NaN

In [19]:
cast[(cast.year > 2000) & (cast.name == 'Zoe Saldana')].sort_values('year').tail()

,title,year,name,type,character,n
3259752,Live by Night,2017,Zoe Saldana,actress,Graciella Suarez,NaN
3259748,Guardians of the Galaxy Vol. 2,2017,Zoe Saldana,actress,Gamora,NaN
3259733,Avatar 2,2018,Zoe Saldana,actress,Neytiri,NaN
3259734,Avatar 3,2020,Zoe Saldana,actress,Neytiri,NaN
3259735,Avatar 4,2022,Zoe Saldana,actress,Neytiri,NaN

In [20]:
cast[(cast.title == 'Avatar 2') | (cast.title == 'Avatar 3')].sort_values('year')

            title  year             name     type       character   n
1195787  Avatar 2  2018     Stephen Lang    actor  Miles Quaritch NaN
2320895  Avatar 2  2018  Sam Worthington    actor      Jake Sully NaN
3259733  Avatar 2  2018      Zoe Saldana  actress         Neytiri NaN
1195788  Avatar 3  2020     Stephen Lang    actor  Miles Quaritch NaN
2320896  Avatar 3  2020  Sam Worthington    actor      Jake Sully NaN
3259734  Avatar 3  2020      Zoe Saldana  actress         Neytiri NaN

#### Mutability

Another thing that takes some getting used to is Pandas *mutability*.  Pandas prefers never to *mutate*, or change, a dataframe object unless you explicitly tell it to. Instead, it creates a copy and assigns that to the new dataframe.

In [21]:
sorted_titles = titles.sort_values('year')
sorted_titles.head()

                                                    title  year
172508                                         Miss Jerry  1894
120909     Reproduction of the Corbett and Jeffries Fight  1899
92240                            Trouble in Hogan's Alley  1900
19987   Pierrot's Problem, or How to Make a Fat Wife O...  1900
178104                              Soldiers of the Cross  1900

If you want to force a change into a dataframe, use the `inplace=True` argument.

In [22]:
titles.sort_values('year', inplace=True)
titles.head()

                                                    title  year
172508                                         Miss Jerry  1894
120909     Reproduction of the Corbett and Jeffries Fight  1899
92240                            Trouble in Hogan's Alley  1900
19987   Pierrot's Problem, or How to Make a Fat Wife O...  1900
178104                              Soldiers of the Cross  1900

## Exercises
Borrowed from the great Brandon Rhodes: http://rhodesmill.org/brandon/

Most (if not all) of these exercises can be done in a single line. Be precise! If a question asks "How many movies...", then your answer should return a number.

### What are the earliest two films listed in the titles dataframe?

In [27]:
titles.sort_values('year').head(2)

                                                 title  year
172508                                      Miss Jerry  1894
120909  Reproduction of the Corbett and Jeffries Fight  1899

### How many movies are titled "North by Northwest"?

In [31]:
titles[titles.title == 'North by Northwest']

                     title  year
135208  North by Northwest  1959

### List all of the "Treasure Island" movies from earliest to most recent.

In [34]:
titles[titles.title == 'Treasure Island'].sort_values(by='year')

                  title  year
200028  Treasure Island  1918
49788   Treasure Island  1920
185450  Treasure Island  1934
94134   Treasure Island  1950
57897   Treasure Island  1972
108165  Treasure Island  1973
199418  Treasure Island  1985
174075  Treasure Island  1999

### How many movies were made in the year 1950?

In [37]:
titles[titles.year == '1951']

Empty DataFrame
Columns: [title, year]
Index: []

### In what years has a movie titled "Batman" been released?

### How many roles were there in the movie "Inception"?

### How many people have played a role called "The Dude"?

### How many roles has Sidney Poitier played throughout his career?

# More pandas excercises..

# TCGA

The Cancer Genome Atlas (TCGA) is a landmark cancer project that characterized over 20,000 primary cancer samples. On cbioportal(https://www.cbioportal.org), you can explore TCGA data. In the following excercises you will use pandas to find subsets of samples that have different mutations. KRAS and EGFR are two genes that are freqeuntly mutated in lung cancer patients. The table below (mutation_table) was generated using cbioportal and shows which samples have a mutation (or multiple mutations) in KRAS and EGFR. 'Nan' represents the samples that do not have a mutation in that gene. 

Use pandas to answer the following questions. You will likely have to use google!

In [23]:
mutation_table = pd.read_csv('data/luad_tcga_pan_can_atlas_2018_KRAS_EGFR_mut.txt',sep = "\t", index_col=None)
mutation_table.head()

                       STUDY_ID        SAMPLE_ID  KRAS         EGFR
0  luad_tcga_pan_can_atlas_2018  TCGA-05-4244-01  G12C          NaN
1  luad_tcga_pan_can_atlas_2018  TCGA-05-4249-01  G12C          NaN
2  luad_tcga_pan_can_atlas_2018  TCGA-05-4250-01  G12C          NaN
3  luad_tcga_pan_can_atlas_2018  TCGA-05-4382-01   NaN  R222L E545Q
4  luad_tcga_pan_can_atlas_2018  TCGA-05-4384-01   NaN          NaN

### How many samples have no mutations in KRAS or EGFR?

### How many samples have mutations in both KRAS and EGFR?

### How many samples have a KRAS mutation at position G12 ? (Can be G12V, G12C, etc.)

### How many samples have more than one mutation in EGFR?

NIH BD2K Center for Big Data in Translational Genomics, UCSC Genomics Institute